spec/fixtures/stripe_webhooks/payout.paid.livemode.json

{
  "id": "evt_1G3Xg9LSBhzwNkXWg1U5iSmJ",
  "object": "event",
  "account": "acct_15UMSDLSBhzwNkXW",
  "api_version": "2019-12-03",
  "created": 1579655205,
  "data": {
    "object": {
      "id": "po_1G3CcgLSBhzwNkXWasSsBQ0w",
      "object": "payout",
      "amount": 6379,
      "arrival_date": 1579651200,
      "automatic": true,
      "balance_transaction": "txn_1G3CcgLSBhzwNkXWkSLNQRoT",
      "created": 1579574266,
      "currency": "usd",
      "description": "STRIPE PAYOUT",
      "destination": "ba_15UMW5LSBhzwNkXWwDvwHghS",
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "livemode": true,
      "metadata": {
      },
      "method": "standard",
      "source_type": "card",
      "statement_descriptor": null,
      "status": "paid",
      "type": "bank_account"
    }
  },
  "livemode": true,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "payout.paid"
}